# -*-  coding: utf-8  -*-

import re
# 临时处理

# 1. 构造 公告关键字JSON

def buildKeysJson():
    keylists = [ "临时股东大会", "独立董事", "使用部分闲置募集资金", "监事会",
                 "公司章程", "改聘", "对外担保", "律师事务所", "会计师事务所","财务顾问",
                 "法律意见书", "运用闲置资金购买银行", "股票交易异常波动公告",
                  "上市保荐书", "鉴证报告", "监事", "担保公告", "审计报告",
                 "延期复牌", "继续停牌", "秘书职责", "债券募集说明书","变更保荐",
                 "停牌进展","职工监事","聘任证券事务代表","理财产品", "制度", "规则",
                 "次级债券","监管协议", "解除质押", "投资者接待","财富管理顾问",
                 "归还闲置募集资金","高管辞职", "内部控制审核报告", "土地增值税",
                 "股权解押", "质押", "股权质押", "股票质押","股份质押", "董事辞职", "风险投资", "办法",
                 "考核管理办法", "秘书辞职", "高管辞职", "高管离职", "逝世", "意见",
                 "工商变更登记", "质押部分股份", "登记完成", "人员名单", "委托理财",
                 "债权人会议", "辞去董事职务", "聘任", "验资报告", "金融服务协议",
                 "工作细则", "债券更名", "募集资金使用情况报告", "可行性分析报告",
                 "会议决议公告", "辞职", "补充公告", "股东回报规划", "章程",
                 "电话号码变更", "决议公告", "高级管理人员","闲置募集资金","三证合一",
                 "提供担保", "孙公司", "任职资格", "股东分红回报规划","秘书任职",
                 "内部控制审计机构", "证券事务代表","会议决议", "证券市场投资","离职",
                 "会计估计变更", "注销全资子公司","定期存款账户", "股份质解押","会计政策",
                 "现场检查", "投资理财","更换保荐代表人","名称变更","辞去%职务",
                 "审计机构", "承诺函", "评估说明", "评估报告", "关联交易", "异常波动",
                 "租赁办公场所", "承诺与声明", "工商登记", "保荐机构", "补选董事", 
                 "承诺事项", "股价异动", "投资者交流会", "工商注册登记", "董事会秘书",
                 "实施细则", "换届选举", "合规性报告","验证报告", "声明与承诺", "权益变动",
                 "法定代表人", "政府补助", "营业执照", "办公室", "补充协议", "审核报告",
                 "开户行", "补选", "竣工", "审计负责人","担保", "已取消", "搬迁", 
                 "高新技术企业", "政府补贴", "闲置房产", "股权转让", "承诺不减持", \
                 "中期票据", "选举董事", "组织架构", "证券投资", "内部控制", "股份解质",
                 "确认函", "进展", "社会责任", "对外投资", "保荐代表人", "联系方式",
                 "履职情况", "停牌", "占用资金", "风险提示", "业绩说明会", "专项审计说明",
                 "子公司更名", "设立全资子公司", "不在担任", "合格投资者", "股票摊薄",
                 "公司名称", "核查报告", "证券简称", "募集资金", "政府贴息", "环境报告",
                 "薪酬方案", "履职报告", "持续督导", "付息", "会议资料", "投资者保护",
                 "综合授信", "高管变动", "银行理财", "增值税", "推荐函", "有效性的说明",
                 "规定的说明", "形象代言人", "网上路演公告", "投资风险特别公告", \
                 "报告披露提示性公告", "法律意见", "财务资助", "保荐", "资产减值", "债券",
                 "配股"]
    jsonstr = '[ \n'

    modelstr = '"model":"report.reportkeystbl", '
    fp = open( 'json.txt', 'w+', encoding='utf-8')

    for item in keylists:
        #print(item)
        if ( item not in jsonstr ):  # 过滤掉可能重复的项, 比如"高管辞职"
            jsonstr += '    {'+ modelstr + '"fields":{"key":"' +item+'"}},\n'

    jsonstr += ']'

    fp.write(jsonstr)
    fp.close()

    return jsonstr



#buf = buildKeysJson()
#print(buf)

buf = '病案号	住院次数	病案号1	姓名	性别	出生日期	年龄\t'
reg = re.compile(r'(.+\t)')   # 单条公告数据的正则表达式
l = re.findall( reg, buf )             # 返回结果是各List, 以下同

print(l)
